TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_mpu6050.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_MST_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_MST_CTRL_MULT_MST_EN                                      \
                                0x80        // Multi-master enable
#define MPU6050_I2C_MST_CTRL_WAIT_FOR_ES                                      \
                                0x40        // Wait for external sensor data
#define MPU6050_I2C_MST_CTRL_SLV3_FIFO_EN                                     \
                                0x20        // Slave 3 FIFO enable
#define MPU6050_I2C_MST_CTRL_I2C_MST_P_NSR                                    \
                                0x10        // No repeated start conditions
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_M                                    \
                                0x0F        // I2C master clock speed
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_348                                  \
                                0x00        // 348 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_333                                  \
                                0x01        // 333 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_320                                  \
                                0x02        // 320 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_308                                  \
                                0x03        // 308 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_296                                  \
                                0x04        // 296 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_286                                  \
                                0x05        // 286 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_276                                  \
                                0x06        // 276 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_267                                  \
                                0x07        // 267 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_258                                  \
                                0x08        // 258 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_500                                  \
                                0x09        // 500 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_471                                  \
                                0x0A        // 471 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_444                                  \
                                0x0B        // 444 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_421                                  \
                                0x0C        // 421 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_400                                  \
                                0x0D        // 400 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_381                                  \
                                0x0E        // 381 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_364                                  \
                                0x0F        // 364 kHz I2C master clock
#define MPU6050_I2C_MST_CTRL_I2C_MST_CLK_S                                    \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV0_ADDR
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV0_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU6050_I2C_SLV0_ADDR_M 0x7F        // Slave address
#define MPU6050_I2C_SLV0_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV0_REG
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV0_REG_M  0xFF        // Slave register number
#define MPU6050_I2C_SLV0_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV0_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV0_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU6050_I2C_SLV0_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU6050_I2C_SLV0_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU6050_I2C_SLV0_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU6050_I2C_SLV0_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU6050_I2C_SLV0_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV1_ADDR
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV1_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU6050_I2C_SLV1_ADDR_M 0x7F        // Slave address
#define MPU6050_I2C_SLV1_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV1_REG
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV1_REG_M  0xFF        // Slave register number
#define MPU6050_I2C_SLV1_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV1_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV1_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU6050_I2C_SLV1_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU6050_I2C_SLV1_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU6050_I2C_SLV1_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU6050_I2C_SLV1_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU6050_I2C_SLV1_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV2_ADDR
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV2_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU6050_I2C_SLV2_ADDR_M 0x7F        // Slave address
#define MPU6050_I2C_SLV2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV2_REG
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV2_REG_M  0xFF        // Slave register number
#define MPU6050_I2C_SLV2_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV2_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV2_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU6050_I2C_SLV2_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU6050_I2C_SLV2_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU6050_I2C_SLV2_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU6050_I2C_SLV2_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU6050_I2C_SLV2_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV3_ADDR
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV3_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU6050_I2C_SLV3_ADDR_M 0x7F        // Slave address
#define MPU6050_I2C_SLV3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV3_REG
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV3_REG_M  0xFF        // Slave register number
#define MPU6050_I2C_SLV3_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV3_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV3_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU6050_I2C_SLV3_CTRL_BYTE_SW                                         \
                                0x40        // Byte-swap word pairs
#define MPU6050_I2C_SLV3_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU6050_I2C_SLV3_CTRL_GRP                                             \
                                0x10        // Word pair grouping
#define MPU6050_I2C_SLV3_CTRL_LEN_M                                           \
                                0x0F        // Number of bytes to transfer
#define MPU6050_I2C_SLV3_CTRL_LEN_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV4_ADDR
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV4_ADDR_RW                                              \
                                0x80        // Read/not write
#define MPU6050_I2C_SLV4_ADDR_M 0x7F        // Slave address
#define MPU6050_I2C_SLV4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV4_REG
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV4_REG_M  0xFF        // Slave register number
#define MPU6050_I2C_SLV4_REG_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV4_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV4_CTRL_EN                                              \
                                0x80        // Enable slave
#define MPU6050_I2C_SLV4_CTRL_INT_EN                                          \
                                0x40        // Interrupt enable
#define MPU6050_I2C_SLV4_CTRL_REG_DIS                                         \
                                0x20        // Disable register number transfer
#define MPU6050_I2C_SLV4_CTRL_I2C_MST_DLY_M                                   \
                                0x1F        // Slave access delay
#define MPU6050_I2C_SLV4_CTRL_I2C_MST_DLY_S                                   \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV4_DI
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV4_DI_M   0xFF        // Input data
#define MPU6050_I2C_SLV4_DI_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_MST_STATUS
// register.
//
//*****************************************************************************
#define MPU6050_I2C_MST_STATUS_PASS_THROUGH                                   \
                                0x80        // Pass through FSYNC interrupt
                                            // status
#define MPU6050_I2C_MST_STATUS_I2C_SLV4_DONE                                  \
                                0x40        // I2C slave 4 completion status
#define MPU6050_I2C_MST_STATUS_I2C_LOST_ARB                                   \
                                0x20        // I2C arbitration lost status
#define MPU6050_I2C_MST_STATUS_I2C_SLV4_NACK                                  \
                                0x10        // I2C slave 4 NACK status
#define MPU6050_I2C_MST_STATUS_I2C_SLV3_NACK                                  \
                                0x08        // I2C slave 3 NACK status
#define MPU6050_I2C_MST_STATUS_I2C_SLV2_NACK                                  \
                                0x04        // I2C slave 2 NACK status
#define MPU6050_I2C_MST_STATUS_I2C_SLV1_NACK                                  \
                                0x02        // I2C slave 1 NACK status
#define MPU6050_I2C_MST_STATUS_I2C_SLV0_NACK                                  \
                                0x01        // I2C slave 0 NACK status

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_INT_PIN_CFG
// register.
//
//*****************************************************************************
#define MPU6050_INT_PIN_CFG_INT_LEVEL                                         \
                                0x80        // INT pin active low
#define MPU6050_INT_PIN_CFG_INT_OPEN                                          \
                                0x40        // INT pin open-drain
#define MPU6050_INT_PIN_CFG_LATCH_INT_EN                                      \
                                0x20        // Latch INT pin output
#define MPU6050_INT_PIN_CFG_INT_RD_CLEAR                                      \
                                0x10        // Interrupt clear on any read
#define MPU6050_INT_PIN_CFG_FSYNC_INT_LEVEL                                   \
                                0x08        // FSYNC pin active low
#define MPU6050_INT_PIN_CFG_FSYNC_INT_EN                                      \
                                0x04        // FSYNC pin interrupt enable
#define MPU6050_INT_PIN_CFG_I2C_BYPASS_EN                                     \
                                0x02        // I2C bypass enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_INT_ENABLE
// register.
//
//*****************************************************************************
#define MPU6050_INT_ENABLE_MOT_EN                                             \
                                0x40        // Motion detection interrupt
                                            // enable
#define MPU6050_INT_ENABLE_FIFO_OFLOW_EN                                      \
                                0x10        // FIFO overflow interrupt enable
#define MPU6050_INT_ENABLE_I2C_MST_INT_EN                                     \
                                0x08        // I2C master interrupt enable
#define MPU6050_INT_ENABLE_DATA_RDY_EN                                        \
                                0x01        // Data ready interrupt enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_INT_STATUS
// register.
//
//*****************************************************************************
#define MPU6050_INT_STATUS_MOT_INT                                            \
                                0x40        // Motion detection interrupt
                                            // status
#define MPU6050_INT_STATUS_FIFO_OFLOW_INT                                     \
                                0x10        // FIFO overflow interrupt status
#define MPU6050_INT_STATUS_I2C_MST_INT                                        \
                                0x08        // I2C master interrupt status
#define MPU6050_INT_STATUS_DATA_RDY_INT                                       \
                                0x01        // Data ready interrupt status

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_XOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_XOUT_H_M  0xFF        // Bits [15:8] of X-axis
                                            // acceleration data
#define MPU6050_ACCEL_XOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_XOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_XOUT_L_M  0xFF        // Bits [7:0] of X-axis
                                            // acceleration data
#define MPU6050_ACCEL_XOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_YOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_YOUT_H_M  0xFF        // Bits [15:8] of Y-axis
                                            // acceleration data
#define MPU6050_ACCEL_YOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_YOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_YOUT_L_M  0xFF        // Bits [7:0] of Y-axis
                                            // acceleration data
#define MPU6050_ACCEL_YOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_ZOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_ZOUT_H_M  0xFF        // Bits [15:8] of Z-axis
                                            // acceleration data
#define MPU6050_ACCEL_ZOUT_H_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_ACCEL_ZOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_ZOUT_L_M  0xFF        // Bits [7:0] of Z-axis
                                            // acceleration data
#define MPU6050_ACCEL_ZOUT_L_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_TEMP_OUT_H
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_TEMP_OUT_H_M                                            \
                                0xFF        // Bits [15:8] of temperature data
#define MPU6050_ACCEL_TEMP_OUT_H_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_TEMP_OUT_L
// register.
//
//*****************************************************************************
#define MPU6050_ACCEL_TEMP_OUT_L_M                                            \
                                0xFF        // Bits [7:0] of temperature data
#define MPU6050_ACCEL_TEMP_OUT_L_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_XOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_XOUT_H_M   0xFF        // Bits [15:8] of X-axis gyro data
#define MPU6050_GYRO_XOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_XOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_XOUT_L_M   0xFF        // Bits [7:0] of X-axis gyro data
#define MPU6050_GYRO_XOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_YOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_YOUT_H_M   0xFF        // Bits [15:8] of Y-axis gyro data
#define MPU6050_GYRO_YOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_YOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_YOUT_L_M   0xFF        // Bits [7:0] of Y-axis gyro data
#define MPU6050_GYRO_YOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_ZOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_ZOUT_H_M   0xFF        // Bits [15:8] of Z-axis gyro data
#define MPU6050_GYRO_ZOUT_H_S   0

